Documents/УЧ_Операция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>УЧ_Операция</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Учетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагКрахмал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагВалюта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГуидВД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПересчитыватьЦенуСписанияВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проводки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДебет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1Дебет</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2Дебет</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3Дебет</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКредит</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1Кредит</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2Кредит</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3Кредит</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаКт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалСуммаКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалСуммаДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеСчетДт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеСчетКт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccountingRegister>
		<Properties>
			<Name>Учетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Учетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Предприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКРХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Крахмал</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПобочнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплектующие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полуфабрикаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сырье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УЧ_Операция/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если РучнаяКорректировка Тогда		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Движения документа %1 отредактированы вручную и не могут быть автоматически актуализированы'"), ЭтотОбъект);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.КлючДанных = Ссылка;
		Сообщение.Сообщить();		
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ВодочноеНаправление = Справочники.НаправленияДеятельности.НайтиПоНаименованию("Водочное", Истина);
	Списывать10ПоОстаткам = Ложь;
	ТаблицаРетробонусов = Неопределено;
	РезультатЗапроса = Неопределено;
		
	РассчетРетробонусов = Ложь;
		
	Движения.Учетный.Записывать = Истина;	
	
	Для Каждого ТекСтрокаПроводки Из Проводки Цикл
		Движение = Движения.Учетный.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ТекСтрокаПроводки.СчетДебет;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,ТекСтрокаПроводки.СчетДебет,1,ТекСтрокаПроводки.Субконто1Дебет);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,ТекСтрокаПроводки.СчетДебет,2,ТекСтрокаПроводки.Субконто2Дебет);
		Если Не ЗначениеЗаполнено(ТекСтрокаПроводки.Субконто3Дебет) Тогда
			ТекСубконто3 = Справочники.Субконто.ПустаяСсылка();
		Иначе
			ТекСубконто3 = ТекСтрокаПроводки.Субконто3Дебет;
		КонецЕсли;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,ТекСтрокаПроводки.СчетДебет,3,ТекСубконто3);
		Движение.СчетКт = ТекСтрокаПроводки.СчетКредит;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,ТекСтрокаПроводки.СчетКредит,1,ТекСтрокаПроводки.Субконто1Кредит);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,ТекСтрокаПроводки.СчетКредит,2,ТекСтрокаПроводки.Субконто2Кредит);
		Если Не ЗначениеЗаполнено(ТекСтрокаПроводки.Субконто3Кредит) Тогда
			ТекСубконто3 = Справочники.Субконто.ПустаяСсылка();
		Иначе
			ТекСубконто3 = ТекСтрокаПроводки.Субконто3Кредит;
		КонецЕсли;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,ТекСтрокаПроводки.СчетКредит,3,ТекСубконто3);		
		//количество
		Если ТекСтрокаПроводки.СчетДебет.Количественный Тогда
			Если ТекСтрокаПроводки.Сумма = 0 И (ВидОперации = "Свертка" ИЛИ ВидОперации = "Свертка счетов") Тогда 
				Движение.КоличествоДт = - ТекСтрокаПроводки.КоличествоДт;
			Иначе
				Движение.КоличествоДт = ТекСтрокаПроводки.КоличествоДт;
			КонецЕсли;
		КонецЕсли;
		Если ТекСтрокаПроводки.СчетКредит.Количественный Тогда
			Если ТекСтрокаПроводки.Сумма = 0 И (ВидОперации = "Свертка" ИЛИ ВидОперации = "Свертка счетов") Тогда 
				Движение.КоличествоКт = - ТекСтрокаПроводки.Количество;
			Иначе
				Движение.КоличествоКт = ТекСтрокаПроводки.Количество;
			КонецЕсли;
		КонецЕсли;		
		//крахмал
		Если ТекСтрокаПроводки.СчетДебет.Крахмал Тогда
			Движение.КоличествоКРХДт = ТекСтрокаПроводки.Крахмал;
		КонецЕсли;
		Если ТекСтрокаПроводки.СчетКредит.Крахмал Тогда
			Движение.КоличествоКРХКт = ТекСтрокаПроводки.Крахмал;
		КонецЕсли;
		//валютный
		Если ТекСтрокаПроводки.СчетДебет.Валютный И ТекСтрокаПроводки.ВалСуммаДт Тогда
			Движение.ВалютаДт = ТекСтрокаПроводки.ВалютаДт;
			Движение.ВалютнаяСуммаДт = ТекСтрокаПроводки.ВалСуммаДт;
		КонецЕсли;
		Если ТекСтрокаПроводки.СчетКредит.Валютный И ТекСтрокаПроводки.ВалСуммаКт Тогда
			Движение.ВалютаКт = ТекСтрокаПроводки.ВалютаКт;
			Движение.ВалютнаяСуммаКт = ТекСтрокаПроводки.ВалСуммаКт;
		КонецЕсли;
		//подразделение
		Если ТекСтрокаПроводки.СчетДебет.УчетПоПодразделениям Тогда
		    Движение.ПодразделениеДт = ТекСтрокаПроводки.ПодразделениеДт;		
		КонецЕсли;
		Если ТекСтрокаПроводки.СчетКредит.УчетПоПодразделениям Тогда
			Движение.ПодразделениеКт = ТекСтрокаПроводки.ПодразделениеКт;
		КонецЕсли;		
		Движение.Предприятия = Предприятие;
		Движение.СценарийПлана = Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина);
		Если НЕ ПустаяСтрока(Комментарий) И НЕ ПустаяСтрока(ТекСтрокаПроводки.Содержание) Тогда
			Движение.Содержание = Комментарий + Символы.ПС + ТекСтрокаПроводки.Содержание;
		ИначеЕсли ПустаяСтрока(ТекСтрокаПроводки.Содержание) Тогда
			Движение.Содержание = Комментарий;
		ИначеЕсли ПустаяСтрока(Комментарий) Тогда
			Движение.Содержание = ТекСтрокаПроводки.Содержание;
		КонецЕсли;
		Если Списывать10ПоОстаткам И (Движение.СчетКт = ПланыСчетов.Учетный._10_09 Или Движение.СчетКт = ПланыСчетов.Учетный.Счет41()) Тогда
			Выборка = РезультатЗапроса.Выбрать();
			СтрукутраПоиска = Новый Структура("Субконто1, Счет, Субконто2", ТекСтрокаПроводки.Субконто1Кредит, Движение.СчетКт, ТекСтрокаПроводки.Субконто2Кредит) ;
			Если Выборка.НайтиСледующий(СтрукутраПоиска) Тогда
				Себестоимость = ?(Выборка.КоличествоОстаток, Выборка.СуммаОстаток / Выборка.КоличествоОстаток, 0);
			Иначе
				Себестоимость = 0;
			КонецЕсли;
			Движение.Сумма = Себестоимость * ТекСтрокаПроводки.Количество;
		Иначе	
			Движение.Сумма = ТекСтрокаПроводки.Сумма;
		КонецЕсли;
		
		Если РассчетРетробонусов Тогда
			
			Если Не ТекСтрокаПроводки.Субконто1Дебет.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//Замена пустого 3 субконто для счета 62.1 на текущий документ
	//Для Каждого ТекСтрока Из Проводки Цикл
	//	Если НЕ ТекСтрока.СчетДебет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Документы)  = Неопределено И
	//		НЕ ЗначениеЗаполнено(ТекСтрока.Субконто3Дебет) Тогда
	//		ТекСтрока.Субконто3Дебет = Ссылка
	//	КонецЕсли;
	//	Если НЕ ТекСтрока.СчетКредит.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Документы)  = Неопределено И
	//		НЕ ЗначениеЗаполнено(ТекСтрока.Субконто3Кредит) Тогда
	//		ТекСтрока.Субконто3Кредит = Ссылка
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

Функция НайтиДоговорКонтрагента(ТекКонтрагент, ТекНаименование)
	
	Если Не ЗначениеЗаполнено(ТекНаименование) Тогда
		ТекНаименование = "Основной";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Наименование = &Наименование
	|	И ДоговорыКонтрагентов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Наименование", ТекНаименование);
	Запрос.УстановитьПараметр("Владелец", ТекКонтрагент);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ТекДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		ТекДоговор.Наименование = ТекНаименование;
		ТекДоговор.Владелец = ТекКонтрагент;
		ТекДоговор.Записать();
		Возврат ТекДоговор.Ссылка;
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;		
	КонецЦикла;	
		
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПересчитыватьЦенуСписанияВПроводках Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		СтруктураИмен = Новый Структура;
		СтруктураИмен.Вставить("Предприятие", "Предприятие");
		СтруктураИмен.Вставить("Подразделение", "Подразделение");
		СтруктураИмен.Вставить("Склад", "Субконто2Кредит");
		СтруктураИмен.Вставить("Номенклатура", "Субконто1Кредит");
		СтруктураИмен.Вставить("Количество", "Количество");
		СтруктураИмен.Вставить("Товары", "Проводки");
		СтруктураИмен.Вставить("Счет10", "СчетКредит");
		
		СтруктураСоответствий = УЧ_Сервер.ПоучитьСоответствияСчетовНоменклатуры(ЭтотОбъект, СтруктураИмен);
		СоответствиеСчета = СтруктураСоответствий.Соответствия;
		СоответствиеУчетаПоПодразделениям = СтруктураСоответствий.СоответствияУчетаПодразделений;
		ДополнительныеСвойства.Вставить("СоответствиеСчета", СоответствиеСчета);
		ДополнительныеСвойства.Вставить("СоответствиеУчетаПоПодразделениям", СоответствиеУчетаПоПодразделениям);
		
		ТаблицаОстатков = УЧ_Сервер.ПолучитьТаблицуОстатков(ЭтотОбъект, СтруктураИмен, СтруктураСоответствий);
		РезультатОстатки = ТаблицаОстатков.РезультатОстатки;
		РезультатКонтроль = ТаблицаОстатков.РезультатКонтроль;
		
		Для Каждого ТекСтрокаТабличнаяЧасть Из Проводки Цикл
			УчетПоподразделениямСчетУчета = СоответствиеУчетаПоПодразделениям.Получить(ТекСтрокаТабличнаяЧасть.СчетКредит);
			
			Если Не ТекСтрокаТабличнаяЧасть.Количество Тогда
				Продолжить;			
			КонецЕсли;
			
			Если УчетПоподразделениямСчетУчета Тогда
				СтруктураПоиска = Новый Структура("Номенклатура, Склад, Счет, Подразделение", ТекСтрокаТабличнаяЧасть.Субконто1Кредит, ТекСтрокаТабличнаяЧасть.Субконто2Кредит, СоответствиеСчета.Получить(ТекСтрокаТабличнаяЧасть.Субконто1Кредит), Подразделение);
			Иначе	
				СтруктураПоиска = Новый Структура("Номенклатура, Склад, Счет", ТекСтрокаТабличнаяЧасть.Субконто1Кредит, ТекСтрокаТабличнаяЧасть.Субконто2Кредит, СоответствиеСчета.Получить(ТекСтрокаТабличнаяЧасть.Субконто1Кредит));
			КонецЕсли;
			ВыборкаДетальныеЗаписи = РезультатОстатки.НайтиСтроки(СтруктураПоиска);
			Если ТекСтрокаТабличнаяЧасть.Количество <> 0 Тогда
				Если ВыборкаДетальныеЗаписи.Количество() Тогда
					Если ТекСтрокаТабличнаяЧасть.Количество = ВыборкаДетальныеЗаписи[0].Количество Тогда
						//ТекСтрокаТабличнаяЧасть.Цена = ВыборкаДетальныеЗаписи[0].Цена;
						ТекСтрокаТабличнаяЧасть.Сумма = ВыборкаДетальныеЗаписи[0].Сумма;
					Иначе	
						//ТекСтрокаТабличнаяЧасть.Цена = ВыборкаДетальныеЗаписи[0].Цена;
						ТекСтрокаТабличнаяЧасть.Сумма = ВыборкаДетальныеЗаписи[0].Цена * ТекСтрокаТабличнаяЧасть.Количество;
					КонецЕсли;
				Иначе
					//ТекСтрокаТабличнаяЧасть.Цена = 0;
					ТекСтрокаТабличнаяЧасть.Сумма = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ДополнительныеСвойства.Вставить("РезультатКонтроль", РезультатКонтроль);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	СуммаОперации = Проводки.Итог("Сумма");
	
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	РучнаяКорректировка = Ложь;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РучнаяКорректировка = Ложь;
	ВидОперации = "Учет";
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	сабОбщегоНазначенияБУХ.сабОбработкиЗаполненияУчпетныхДокументовОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаЗаполненияСФормы(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт

	ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);	

КонецПроцедуры
